app/controllers/homepage_controller.rb

    def disponibilita

        #if you are not a registered user (doctor or visitor) in get request such as in the post (eventually simulated with external programs) you will be redirect to login
        if (!user_signed_in?)
            redirect_to new_user_session_path  #helper method offered by ruby on rails

        else
            if (params[:date]==nil)
                @occupati=nil
            else
                datapass = params[:date]
                datamin = datapass+("00:00:00")
                datamax = datapass+("23:59:59")
                @occupati = Visit.where('data_ora <= ? AND data_ora >= ?', datamax, datamin)
---
SELECT "visits".* FROM "visits" WHERE (data_ora <= ' 23:59:59' AND data_ora >= ' 00:00:00')