app/models/user.rb

  def self.from_omniauth(access_token)

    data = access_token.info
    user = User.where(email: data['email']).first
    unless user
      user = User.create( email: data['email'],password: Devise.friendly_token[0,20],nome:data['first_name'] ,
      cognome:data['last_name'] )
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "cicchetti.1853840@studenti.uniroma1.it"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at", "nome", "cognome") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"